#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
/*输入一行由数字字符或字母构成的字符串（串中连续的数字字符不超过3个，且全串最长不超过80个字符，以回车结束），
请编写程序，从字符串中将被字母分隔的数字全部找出，计算累加和。

例如a1bb23cde400中被字母分隔的数是1、23和400，累加该3个数得到424
串中没有数字字符，则输出0

输入格式
一行字符串（如题目描述）

输出格式
从字符串中将被字母分隔的数字全部找出，输出全部数字累加和

输入样例
a1bb23cde400

输出样例
424*/

int main() 
{
	char s[80];
	gets(s);
	int sum=0,i;
	for(i=0;s[i]!='\0';i++)
	{
		if(s[i]>='0'&&s[i]<='9')
		{
			if(s[i+1]<'0'||s[i+1]>'9')
			{
				sum+=s[i]-'0';
			}
			if(s[i+1]>='0'&&s[i+1]<='9'&&(s[i+2]<'0'||s[i+2]>'9'))
			{
				sum+=(s[i]-'0')*10;
			}
			if(s[i+2]>='0'&&s[i+2]<='9'&&s[i+1]>='0'&&s[i+1]<='9')
			{
				sum+=(s[i]-'0')*100;
			}
		}
	}
	printf("%d",sum);
} 
